_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_СтроительныеРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УСОERP_СтроительныеРаботы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.УСОERP_СценарииПланированияПроектовСтроительства</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодСДР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяСводногоСметногоРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтатьиСводныхСметныхРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКонструктив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_Конструктив</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРаботыВУровне</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммарнаяРабота</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UIDProject</Name>
					<Comment>Служебный реквизит, предназначен для хранения UID, загруженных из MSProject</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Веха</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КритическаяРабота</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедущийПроцесс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоляПроекта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРаботыВУровнеСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задержка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаЗадержки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаДлительности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаОбъема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьПредшественники</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОграничения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ТипыОграничений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОграничения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадержкаОграничения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботаИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьРесурсы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПредшественников</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокСортировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ресурсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗагрузкаПроцент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрафикРаботы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Календари</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Трудоемкость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Машиноемкость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Норма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНаЕдиницуОбъема</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковокНаЕдиницуОбъема</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНаОбъемРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковокНаОбъемРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Предшественники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтроительнаяРабота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗависимости</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УСОERP_ТипыЗависимостейРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задержка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаЗадержки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Конструктивы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Конструктив</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_Конструктив</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Распределение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ВидыПланированияСтроительныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ВидыПланированияСтроительныхРабот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Календарный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месячный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НедельноСуточный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_СтроительныеРаботы/Forms/ФормаСозданияШаблонаИзРабот/Ext/Form/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьШаблон(Команда)
	
	СоздатьШаблонНаСервере();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СоздатьШаблонНаСервере()
	
	Если ПустаяСтрока(Наименование) = "" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указано наименование",,"Наименование");
		Возврат;
	КонецЕсли;
	
	ТаблицаСоответствия = Новый ТаблицаЗначений;
	ТаблицаСоответствия.Колонки.Добавить("Приемник");
	ТаблицаСоответствия.Колонки.Добавить("Источник");
	
	Если НЕ ЗначениеЗаполнено(Источник) Тогда
		
		ШаблонСценария = Справочники.УСОERP_ШаблоныСтроительныхРабот.СоздатьГруппу();  
		ШаблонСценария.Родитель = Группа;
		ШаблонСценария.Наименование = Наименование;
		ШаблонСценария.Записать();
		
		СпрВыборка = Справочники.УСОERP_СтроительныеРаботы.Выбрать(Справочники.УСОERP_СтроительныеРаботы.ПустаяСсылка(),,,"НомерРаботыВУровне");
		
		Пока СпрВыборка.Следующий() Цикл
			
			Элемент = СпрВыборка.Ссылка;
			
			Если ЗначениеЗаполнено(Элемент.Родитель) Тогда
				Продолжить;
			КонецЕсли; 
			
			Если Не Элемент.СуммарнаяРабота Тогда
				
				Шаблон = Справочники.УСОERP_ШаблоныСтроительныхРабот.СоздатьЭлемент();
				Шаблон.Родитель = ШаблонСценария.Ссылка;
				ЗаполнитьОбъектНаОсновании(Шаблон,Элемент);
				Шаблон.Наименование = Элемент.Наименование;
				Шаблон.Записать();
				
				Нстр = ТаблицаСоответствия.Добавить();
				Нстр.Приемник = Шаблон.Ссылка;
				Нстр.Источник = Элемент;
				
			Иначе
				//создаем папку "Шаблонов"
				Шаблон = Справочники.УСОERP_ШаблоныСтроительныхРабот.СоздатьГруппу();   
				Шаблон.Родитель = ШаблонСценария.Ссылка;
				Шаблон.Записать();
				Шаблон.ЗаполнитьШаблонНаОснованииРаботы(Шаблон,Элемент,ТаблицаСоответствия);
				Шаблон.Наименование = Элемент.Наименование;
				Шаблон.Записать();
				
			КонецЕсли;			
			
		КонецЦикла;
		
	Иначе
		
		ШаблонСценария = Справочники.УСОERP_ШаблоныСтроительныхРабот.СоздатьГруппу();  
		ШаблонСценария.Родитель = Группа;
		ШаблонСценария.Наименование = Наименование;
		ШаблонСценария.Записать();
		
		Если ТипЗнч(Источник) = Тип("СписокЗначений") Тогда
			
			ИсточникИерархия = ПолучитьИерархиюВыбранныхСтрок(Источник);	
			
			Для Каждого СтрокаИсточник Из ИсточникИерархия Цикл
				
				РаботаИсточник = СтрокаИсточник.Значение;
				
				Если Не РаботаИсточник.СуммарнаяРабота Тогда
					
					Шаблон = Справочники.УСОERP_ШаблоныСтроительныхРабот.СоздатьЭлемент();
					Шаблон.Родитель = ШаблонСценария.Ссылка;
					ЗаполнитьОбъектНаОсновании(Шаблон,РаботаИсточник);
					Шаблон.Наименование = РаботаИсточник.Наименование;
					Шаблон.Записать();
					
					Нстр = ТаблицаСоответствия.Добавить();
					Нстр.Приемник = Шаблон.Ссылка;
					Нстр.Источник = РаботаИсточник;
					
					
				Иначе
					
					Шаблон = Справочники.УСОERP_ШаблоныСтроительныхРабот.СоздатьГруппу();   
					Шаблон.Родитель = ШаблонСценария.Ссылка;
					Шаблон.Записать();
					Шаблон.ЗаполнитьШаблонНаОснованииРаботы(Шаблон,РаботаИсточник,ТаблицаСоответствия);
					Шаблон.Наименование = РаботаИсточник.Наименование;
					Шаблон.Записать();
					
				КонецЕсли; 
				
			КонецЦикла;	
			
		КонецЕсли;	
		
	КонецЕсли;
	
	ТаблицаСоответствия.Свернуть("Приемник,Источник");
	
	Для Каждого СтрокаСоответствия ИЗ ТаблицаСоответствия Цикл
		
		Если СтрокаСоответствия.Источник.Предшественники.Количество() Тогда
			
			ШаблонОбъект = СтрокаСоответствия.Приемник.ПолучитьОбъект();
			
			Для Каждого СтрокаПредшественник ИЗ  СтрокаСоответствия.Источник.Предшественники Цикл
				
				Строка = ТаблицаСоответствия.Найти(СтрокаПредшественник.СтроительнаяРабота,"Источник");
				Если Строка = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Нстр = ШаблонОбъект.Предшественники.Добавить();
				ЗаполнитьЗначенияСвойств(Нстр,СтрокаПредшественник);
				Нстр.Шаблон = Строка.Приемник;
				
			КонецЦикла; 			
			
			ШаблонОбъект.Записать();
			
		КонецЕсли;  		
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИерархиюВыбранныхСтрок(СписокВыбранныхРабот)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Работа КАК Работа
	|ИЗ
	|	(ВЫБРАТЬ
	|		УСОERP_СтроительныеРаботы.Ссылка КАК Работа
	|	ИЗ
	|		Справочник.УСОERP_СтроительныеРаботы КАК УСОERP_СтроительныеРаботы
	|	ГДЕ
	|		УСОERP_СтроительныеРаботы.Ссылка В(&Массив)
	|		И УСОERP_СтроительныеРаботы.ПометкаУдаления = ЛОЖЬ) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	Работа ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("Массив", СписокВыбранныхРабот.ВыгрузитьЗначения());
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	МасиивЛишнихРабот = Новый Массив;
	СписокРабот = Новый СписокЗначений;
	
	Для Каждого СтрокаРабота Из ВыборкаДетальныеЗаписи.Строки Цикл
		
		РаботаРодитель = СтрокаРабота.Работа.Родитель;
		
		Пока ЗначениеЗаполнено(РаботаРодитель) Цикл
			
			Для Каждого СтрокаРаботаПроверка Из ВыборкаДетальныеЗаписи.Строки Цикл
				
				Если СтрокаРаботаПроверка.Работа = РаботаРодитель Тогда 
					
					МасиивЛишнихРабот.Добавить(СтрокаРабота.Работа);
					
				КонецЕсли;	
				
			КонецЦикла;	
			
			РаботаРодитель = РаботаРодитель.Родитель;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого СтрокаРабота Из ВыборкаДетальныеЗаписи.Строки Цикл
		
		Если МасиивЛишнихРабот.Найти(СтрокаРабота.Работа) = Неопределено Тогда
			
			СписокРабот.Добавить(СтрокаРабота.Работа);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СписокРабот;
	
КонецФункции	

&НаСервере
Процедура ЗаполнитьОбъектНаОсновании(Приемник, Источник) Экспорт
	
	Если НЕ ТипЗнч(Источник) = Тип("Структура") Тогда
		
		ИсточникМетаданные = Источник.Метаданные();
		ПриемникМетаданные = Приемник.Метаданные();
		
		// Переносим реквизиты
		Для Каждого Реквизит Из ПриемникМетаданные.Реквизиты Цикл
			РеквизитИсточник = ИсточникМетаданные.Реквизиты.Найти(Реквизит.Имя);
			Если РеквизитИсточник <> Неопределено Тогда 			
				Приемник[Реквизит.Имя] = Источник[Реквизит.Имя];
			КонецЕсли;
		КонецЦикла;
		
		Если Источник.Владелец.НовыйВариант Тогда
			
			Приемник.ОбъемРаботы 		 = Источник.ОбъемРаботы;
			Приемник.ЕдиницаОбъема       = Источник.ЕдиницаОбъема;
			Приемник.ДлительностьПлан	 = Источник.Длительность;
			Приемник.ЕдиницаДлительности = Источник.ЕдиницаДлительности;
			
			Приемник.Материалы.Загрузить(Источник.Материалы.Выгрузить());
			ТабРесурсы = Источник.Ресурсы.Выгрузить();
			ТабРесурсы.Колонки.ЗагрузкаПроцент.Имя = "Загрузка";
			Приемник.Ресурсы.Загрузить(ТабРесурсы);
			
		Иначе
			
			ПараметрыВыполненияРаботы = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьПараметрыВыполненияРаботы(Источник, Перечисления.УСОERP_ВидыПланированияСтроительныхРабот.Календарный, ТекущаяДата()); 
			
			Приемник.ОбъемРаботы 		  = ПараметрыВыполненияРаботы.ОбъемРаботы;
			Приемник.ЕдиницаОбъема       = ПараметрыВыполненияРаботы.ЕдиницаОбъема;
			Приемник.ДлительностьПлан	  = ПараметрыВыполненияРаботы.ДлительностьПлан;
			Приемник.ЕдиницаДлительности = ПараметрыВыполненияРаботы.ЕдиницаДлительности;
			
			// Заполняем табличные части 
			ТаблицаМатериалов = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьПотребностьВМатериалах(Источник, Перечисления.УСОERP_ВидыПланированияСтроительныхРабот.Календарный, ТекущаяДата());
			
			//ТаблицаМатериалов.Колонки.Номенклатура.Имя = "Материал";
			Для Каждого СтрокаМатериал Из ТаблицаМатериалов Цикл
				
				НоваяСтрока = Приемник.Материалы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМатериал);
				
			КонецЦикла;
			
			ТаблицаРесурсов = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьПотребностьВРесурсах(Источник, Перечисления.УСОERP_ВидыПланированияСтроительныхРабот.Календарный, ТекущаяДата());
			ТаблицаРесурсов.Колонки.ЗагрузкаПроцент.Имя = "Загрузка";
			
			Для Каждого СтрокаРесурс Из ТаблицаРесурсов Цикл
				
				НоваяСтрока = Приемник.Ресурсы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРесурс);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
